# install tabs
tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "hudochenkov/sshpass"
tap "jesseduffield/lazygit"
tap "teamookla/speedtest"
tap "go-task/tap"

# install packages
brew "aichat"
brew "aws2-wrap"
brew "bash-completion"
brew "bat"
brew "boost"
brew "certifi"
brew "cloc"
brew "cmake"
brew "csvkit"
brew "direnv"
brew "duckdb"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gmp"
brew "gnupg"
brew "go"
brew "go-task"
brew "iperf3"
brew "jq"
brew "lazygit"
brew "libevent"
brew "libyaml"
brew "lua"
brew "luarocks"
brew "macos-trash"
brew "markdownlint-cli"
brew "moreutils"
brew "mutagen-io/mutagen/mutagen"
brew "neovim"
brew "nmap"
brew "node"
brew "openjdk"
brew "openssl@1.1"
brew "pgbouncer"
brew "pipx"
brew "postgresql@14"
brew "prettierd"
brew "pv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
brew "rbenv"
brew "readline"
brew "redis"
brew "ripgrep"
brew "ruby-build"
brew "shellcheck"
brew "shfmt"
brew "source-highlight"
brew "speedtest"
brew "sphinx-doc"
brew "sshpass"
brew "starship"
brew "stylua"
brew "swagger-codegen"
brew "tealdeer"
brew "telnet"
brew "tmux"
brew "tree"
brew "uv"
brew "vim"
brew "wakeonlan"
brew "watch"
brew "watchman"
brew "wget"
brew "xz"
brew "yadm"
brew "zlib"
brew "zoxide"

# install casts
cask "1password-cli"
cask "alacritty"
cask "claude-code"
cask "codex"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "iterm2"
cask "kiro-cli"
cask "macdown"
cask "reactotron"
cask "rectangle"
cask "session-manager-plugin"
cask "sublime-text"
cask "visual-studio-code"
